In [1]:
import pandas as pd

In [2]:
df_CDHDR = pd.read_csv('B:/Programming/Processand/Data/CDHDR.csv')
print(df_CDHDR.shape)
df_CDHDR.head(n=5)

#  CDHDR contains general information for the change such as time of change and username

(53293, 7)

   MANDANT OBJECTCLAS    OBJECTID   CHANGENR     UDATE   UTIME  TCODE
0      100  VERKBELEG    33015440  165713807  20220310  110047   VA02
1      100  VERKBELEG    30657319  165673474  20220308  101800   ZVAL
2      100  VERKBELEG    30656642  164833689  20220221  123932   VA02
3      100  EINKBELEG  4501116647  163546904  20220202  150311  ME21N
4      100  VERKBELEG    30655315  164869495  20220223  124040    NaN

In [18]:
df_CDPOS = pd.read_csv('B:/Programming/Processand/Data/CDPOS.csv', dtype = str)
print(df_CDPOS.shape)
df_CDPOS.head(n=5)

# CDPOS links to the changed document

(158111, 10)

,MANDANT,OBJECTCLAS,OBJECTID,CHANGENR,TABNAME,TABKEY,FNAME,CHNGIND,VALUE_NEW,VALUE_OLD
0,100,EINKBELEG,4501113714,0163221568,EKPO,100450111371400010,LABNR,U,122000702 21.12.21,NaN
1,100,EINKBELEG,4501119196,0165192430,EKKO,1004501119196,KEY,I,NaN,NaN
2,100,VERKBELEG,0020577003,0166104981,VBAP,1000020577003000190,KEY,I,NaN,NaN
3,100,VERKBELEG,0020575233,0163175850,VBAK,1000020575233,LIFSK,U,NaN,10
4,100,VERKBELEG,0023001882,0166058070,VBAP,1000023001882000090,KEY,I,NaN,NaN

In [21]:
filter_FNAME = ['NETWR','KEY']
filter_TABNAME = ['EKKO','EKPO']

df_CDPOS = df_CDPOS[df_CDPOS.FNAME.isin(filter_FNAME) & df_CDPOS.TABNAME.isin(filter_TABNAME)]

print(df_CDPOS.shape)
df_CDPOS.head(n=5)

(26615, 10)

,MANDANT,OBJECTCLAS,OBJECTID,CHANGENR,TABNAME,TABKEY,FNAME,CHNGIND,VALUE_NEW,VALUE_OLD
1,100,EINKBELEG,4501119196,0165192430,EKKO,1004501119196,KEY,I,NaN,NaN
10,100,EINKBELEG,4501117434,0164001954,EKKO,1004501117434,KEY,I,NaN,NaN
17,100,EINKBELEG,4501115709,0163343001,EKPO,100450111570900020,NETWR,U,49.28,35.00
20,100,EINKBELEG,4501115398,0163223882,EKPO,100450111539800590,NETWR,U,34.02,105.48
22,100,EINKBELEG,4501122969,0168025746,EKKO,1004501122969,KEY,I,NaN,NaN

In [22]:
df_EKKO = pd.read_csv('B:/Programming/Processand/Data/EKKO.csv')
print(df_EKKO.shape)
df_EKKO.head(n=5)

# Which purchase orders have been created?
# Contains one row for each Purchase Order

(2125, 9)

   MANDT       EBELN   LIFNR  BUKRS BSTYP BSART  LOEKZ STATU     AEDAT
0    100  6000025866  200081   1000     A    AN    NaN     A  20220131
1    100  6000025604  290441   1000     A    AN    NaN     A  20220121
2    100  4501115256  209020   1000     F    NB    NaN     9  20220119
3    100  6000025617  276550   1000     A    AN    NaN     A  20220121
4    100  4501115969  255373   1000     F    NB    NaN     9  20220126

In [23]:
df_EKPO = pd.read_csv('B:/Programming/Processand/Data/EKPO.csv', dtype = str)
print(df_EKPO.shape)
df_EKPO.head(n=5)

# Which Purchase Order Items have been created?
# Contains one row for each Purchase Order Item

# Obsahuje podozrivo málo riadkov na to že toto by mal byť hlavný zoznam všetkých objednaných položiek

(153, 10)

,MANDT,EBELN,EBELP,MATNR,BUKRS,WERKS,MENGE,NETPR,NETWR,LABNR
0,100,4501114600,00090,70000025172,1000,1000,1,100.99,100.99,NaN
1,100,4501115249,00770,1-162-011450,1000,1000,2,680.13,1360.26,22-00062
2,100,4501115423,00460,70000141481,1000,1000,1,0.01,0.01,NaN
3,100,4501114826,00020,70000085320,1000,1000,2,149.5,299,224997/25.1.22
4,100,4501115547,00300,1-162-011427,1000,1000,2,105,210,71600-2-22 31.1.2022

In [24]:
df_EKPO['TABKEY'] = df_EKPO['MANDT']+df_EKPO['EBELN']+df_EKPO['EBELP']
print(df_EKPO.shape)
df_EKPO.head(n=5)

(153, 11)

,MANDT,EBELN,EBELP,MATNR,BUKRS,WERKS,MENGE,NETPR,NETWR,LABNR,TABKEY
0,100,4501114600,00090,70000025172,1000,1000,1,100.99,100.99,NaN,100450111460000090
1,100,4501115249,00770,1-162-011450,1000,1000,2,680.13,1360.26,22-00062,100450111524900770
2,100,4501115423,00460,70000141481,1000,1000,1,0.01,0.01,NaN,100450111542300460
3,100,4501114826,00020,70000085320,1000,1000,2,149.5,299,224997/25.1.22,100450111482600020
4,100,4501115547,00300,1-162-011427,1000,1000,2,105,210,71600-2-22 31.1.2022,100450111554700300

In [25]:
combined_changes = pd.merge(df_EKPO, df_CDPOS, on='TABKEY')
print(combined_changes.shape)
combined_changes.head(n=5)

(204, 20)

,MANDT,EBELN,EBELP,MATNR,BUKRS,WERKS,MENGE,NETPR,NETWR,LABNR,TABKEY,MANDANT,OBJECTCLAS,OBJECTID,CHANGENR,TABNAME,FNAME,CHNGIND,VALUE_NEW,VALUE_OLD
0,100,4501114600,00090,70000025172,1000,1000,1,100.99,100.99,NaN,100450111460000090,100,EINKBELEG,4501114600,0164787665,EKPO,KEY,I,NaN,NaN
1,100,4501115249,00770,1-162-011450,1000,1000,2,680.13,1360.26,22-00062,100450111524900770,100,EINKBELEG,4501115249,0163206170,EKPO,KEY,I,NaN,NaN
2,100,4501115249,00770,1-162-011450,1000,1000,2,680.13,1360.26,22-00062,100450111524900770,100,EINKBELEG,4501115249,0163208260,EKPO,NETWR,U,1360.26,1811.26
3,100,4501115423,00460,70000141481,1000,1000,1,0.01,0.01,NaN,100450111542300460,100,EINKBELEG,4501115423,0163315556,EKPO,KEY,I,NaN,NaN
4,100,4501114826,00020,70000085320,1000,1000,2,149.5,299,224997/25.1.22,100450111482600020,100,EINKBELEG,4501114826,0163098187,EKPO,KEY,I,NaN,NaN

In [ ]:
combine_calc_data = pd.merge(df_EKPO, df_EKKO, on='EBELN')
combine_calc_data.head(n=5)

In [ ]:
combine_calc_data['NETWR'] = combine_calc_data['NETWR'].astype(float)
combine_calc_data['MENGE'] = combine_calc_data['MENGE'].astype(float)

combine_calc_data['Total_NOV'] = (combine_calc_data['NETWR'] * combine_calc_data['MENGE'])

combine_calc_data.head(n=5)

In [ ]:
input_MANDT = 100
df0 = combine_calc_data[combine_calc_data['MANDT_x']==input_MANDT]
df0.head(n=5)

In [ ]:

input_date = 20220119
df1 = df0[df0['AEDAT']==input_date]

df1

In [ ]:
input_EBELN = 4501115249
df2 = df1[df1['EBELN']==input_EBELN]
df2

In [ ]:
total = df2['Total_NOV'].sum(axis=0)

total

In [ ]:
combine_changes = pd.merge(df_CDPOS, df_CDHDR, on='EBELN')